IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges
Representing reinforcement bar input on more edges in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.MasterEdges
Master Edges

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.Covers
Covers

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.WholeFirstEdge
Bar is on whole length of first edge

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.LengthFromFirstIntersection
Length of bar from first intersection in the direction of edge

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.WholeLastEdge
Bar is on whole length of last edge

IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges.LengthFromLastIntersection
Length of bar from last intersection in the direction of edge